Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: Special symbols and punctuation should only be included when absolutely necessary. For example, an apostrophe is included in English words like “don’t” and “we’re” and should be included in the source text, but it’s unlikely you’ll ever need a special symbol like “@” or “#.”
ug: ئالاھىدە بەلگىلەر ۋە تىنىش بەلگىلىرى پەقەت زۆرۈر تېپىلغاندا ئۆز ئىچىگە ئېلىنىشى كېرەك. مەسىلەن، ئىنگلىزچە «don’t» ۋە «we’re» دېگەندەك سۆزلەرگە قىسقارتىپ يېزىش بەلگىسى ئەسلى تېكىستكە كىرگۈزۈلۈشى كېرەك، ئەمما سىزگە لازىم بولمايدىغان «@» ياكى «#» غا ئوخشاش ئالاھىدە بەلگە بولماسلىقى لازىم.

source: <speechBlogLink>Get Started with Speech Recognition</speechBlogLink>
ug: <speechBlogLink>ئاۋاز تونۇتۇشنى باشلاڭ</speechBlogLink>

source: Spelling and Punctuation
ug: ئىملا ۋە تىنىش بەلگىلىرى

source: Split into { $archiveCount } ZIP files containing
ug: { $archiveCount } ZIP ھۆججەتىگە پارچىلىسۇن

source: Splits
ug: بۆلۈنمە

source: Splits (Age and Sex)
ug: پارچىلاش (ياش ۋە جىنسى)

source: Start recording
ug: ئۈنگە ئېلىشنى باشلا

source: Start typing to describe your accent
ug: تەلەپپۇزىڭىزنى يېزىق ئارقىلىق تەسۋىرلەڭ

source: Stats
ug: ئىستاتىستىكا

source: Status Page
ug: ھالەت بېتى

source: Still have questions?
ug: يەنىلا سوئال بارمۇ؟

source: Streaks
ug: سىزىقچە

source: <strong>[Crackle]</strong> giant dinosaurs of <strong>[crackle]</strong> -riassic.
ug: <strong>[چاراس-چۇرۇس]</strong>ترىناسىك ئېراسىنىڭ گىگانت <strong>[چاراس-چۇرۇس]</strong>دىنوزاۋرلىرى.

source: <strong>Do not reject clips where the speaker ‘has an accent’ that is different to your own</strong> - this is important for voice recognition to work better for everyone.
ug: <strong>سىزدىن پەرقلىق سۆزلەيدىغان «شېۋەسى بار» ئۈزۈندىنى رەت قىلماڭ</strong>بۇ ئاۋاز پەرقلەندۈرۈشنىڭ كۆپچىلىك ئۈچۈن تېخىمۇ ياخشى ئىشلىشى ئۈچۈن بەكلا مۇھىم.

source: <strong>Get creative!</strong> Your language community will be unique, and these are just a few ways to get started.
ug: <strong>تەسەۋۋۇرىڭىزنى جارى قىلدۇرۇڭ!</strong> تىل جامائىتىڭىز بىردىنبىر، بۇنى بىر قانچە باسقۇچتىلا باشلىيالايسىز.

source: <strong>[Sneeze]</strong> The giant dinosaurs of the <strong>[cough]</strong> Triassic.
ug: <strong>[ھەپچۈشۈ]</strong>ترىناسىك ئېراسىنىڭ گىگانت <strong>[ئۆھۆ]</strong>دىنوزاۋرلىرى.

source: Submit
ug: يوللا

source: Submit All
ug: ھەممىنى يوللا

source: Submit a new question for the community to read and respond to
ug: جامائەتنىڭ ئوقۇپ ۋە جاۋاب بېرىشىگە يېڭى سوئال يوللايدۇ

source: Submit a report
ug: دوكلات يوللاش

source: Submit clips
ug: ئاۋاز يوللا

source: Submit new questions for the community to read and respond to
ug: جامائەتنىڭ ئوقۇپ ۋە ئىنكاس قايتۇرۇشى ئۈچۈن يېڭى سوئال يوللايدۇ

source: Submitted
ug: يوللاندى

source: Subscribe
ug: مۇشتەرى بولۇش

source: Success
ug: مۇۋەپپەقىيەت

source: success checkmark
ug: مۇۋەپپەقىيەت بەلگىسى

source: Success, profile created!
ug: تەرجىمىھال قۇرۇش مۇۋەپپەقىيەتلىك بولدى!

source: Swahili
ug: سىۋالىچە

source: Swedish
ug: شۋېدچە

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
ug: ئوڭغا سۈرۈلسە جۈملە تەستىقلىنىدۇ. سولغا سۈرۈلسە جۈملە رەت قىلىنىدۇ. <strong>تەكشۈرۈش نەتىجىڭىزنى يوللاشنى ئۇنتۇپ قالماڭ!</strong>

source: Syriac
ug: سۈرىيەچە

source: Tagalog
ug: تاگالوگچە

source: Tahitian
ug: تاختىچە

source: Taiwanese (Minnan)
ug: تەيۋەنچە(Minnan)

source: Tajik
ug: تاجىكچە

source: Taking several attempts to read a word.
ug: بىر سۆزنى بىر قانچە قانچە قېتىم ئوقۇشقا ئۇرۇنغان.

source: Tamazight
ug: بەربەرچە

source: Tamil
ug: تامىلچە

source: Tap
ug: نوقۇڭ

source: Tarifit
ug: تارىفىت

source: Tatar
ug: تاتارچە

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
ug: Tatoeba تىل ئۆگىنىشتە ئىشلىتىلىدىغان جۈملە ، تەرجىمە ۋە ئاۋاز ئوقۇلىشىدىن تەركىب تاپقان چوڭ ھەجىمدىكى سانلىق مەلۇمات ئامبىرى. بۇ چۈشۈرۈلمە ئۇلارنىڭ ئىجتىمائىي رايوندىكى كىشىلەرنىڭ ئىنگلىزچە ئۈن خاتىرسىنىمۇ ئۆز ئىچىگە ئالىدۇ.

source: Technology and Robotics
ug: تېخنىكا ۋە ماشىنا ئادەم

source: TED-LIUM Corpus
ug: TED-LIUM سۆزلۈكلەر توپلىمى

source: Teke
ug: تېكى

source: Tell us what you'd like to download:
ug: چۈشۈرمەكچى بولغان نەرسىنى بىزگە ئېيتىپ بېرىڭ:

source: Telugu
ug: تېلۇگۇچە

source: Terms
ug: تۈزۈملەر

source: <termsLink>Terms</termsLink>
ug: <termsLink>ماددىلار</termsLink>

source: Thai
ug: تايلاندچە

source: Thanks for confirming your account, now let's build your profile.
ug: ھېساباتىڭىزنى جەزملەشتۈرگەنلىكىڭىزگە رەھمەت ، ئەمدى تەرجىمىھالىڭىزنى قۇرايلى.

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
ug: 50 تىن ئارتۇق تىلدىكى 259k دىن ئارتۇق كىشىنىڭ تۆھپىسىگە رەھمەت بىلدۈرىمىز، بۇ سانلىق ئۇچۇرلار ئاۋازلىق پروگراممىلارنى مەشىقلەندۈرۈپ ئىنسانلارنىڭ ئاۋازىغا تېخىمۇ ياخشى بولغان ئىنكاس قايتۇرۇلاشى ئۈچۈن ئىشلىتىلىدۇ.

source: Thank you for contributing to Spontaneous Speech!
ug: تەبىئىي سۆھبەتكە تۆھپە قوشقانلىقىڭىزغا رەھمەت!

source: Thank you for contributing your bulk submission!
ug: كۆپ تاپشۇرغان تۆھپىڭىزگە رەھمەت!

source: Thank you for contributing your voice!
ug: ئاۋازىڭىزنى قوشقانلىقىڭىزغا رەھمەت!

source: Thank you for donating your voice clips!
ug: ئاۋازىڭىزنى ئىئانە قىلغانلىقىڭىزغا رەھمەت!

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
ug: ئۈنگە ئالغىنىڭىزغا رەھمەت<lineBreak></lineBreak> ئەمدى تەكشۈرۈڭ شۇنداقلا ئاۋازىڭىزنى يوللاڭ.

source: Thank you for your information
ug: ئۇچۇرىڭىزغا رەھمەت

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
ug: { $lang }غا تۆھپە قوشماقچى بولغىنىڭىزغا رەھمەت. بىز ھەر قانداق بىر تىلنىڭ قوشۇلۇشىغا شۇنداقلا ھەرقايسى گۇرۇپپىدىكى يېڭىلىقلاردىن ئېلخەت ئارقىلىق ۋاقتىدا خەۋەردار قىلىش ئۈچۈن تېرىشچانلىق كۆرسىتىمىز. تۆھپە قوشماقچى بولسىڭىز، تۆۋەندە بىزگە ئېلخەت ئادرېسىڭىزنى تەمىنلەڭ.

source: Thank you for your voice information
ug: ئاۋاز ئۇچۇرلىرىڭىزغا رەھمەت

source: Thank you! You’ve sent a new language enquiry
ug: رەھمەت سىزگە! يېڭى تىل قوشۇش ئىلتىماسىنى ئەۋەتتىڭىز

source: The best sentences are natural and conversational — they should be easy for someone to read. While phonetic diversity and different words in sentences is important, we are also trying to make recording sentences as engaging and fun for our volunteer community as possible.
ug: ئەڭ ياخشى جۈملىلەر تەبىئىي ۋە سۆھبەتلەردۇر - بىراۋنىڭ ئوقۇشى ئاسان بولۇشىدۇر. فونېتىكىلىق كۆپ خىللىق ۋە جۈملىدىكى ئوخشىمىغان سۆزلەر مۇھىم بولسىمۇ، بىز يەنە ئۇن خاتىرىسى جۈملىلىرىنى پىدائىيلار جامائىتىمىز ئۈچۈن ئامالنىڭ بارىچە قىزىقارلىق ۋە جەلپكار قىلىشقا تىرىشىۋاتىمىز.

source: The best sentences for building a useful speech recognition engine are colloquial, modern parlance. Some ideas to help you generate sentences are;
ug: تىل تونۇش موتورى قۇرۇشقا ئىشلىتىدىغان ئەڭ ياخشى جۈملە شەكلى ئېغىز تىلىدىكى جۈملىلەرنىڭ زامانىمىزدىكى ئىشلىتىلىشىدۇر. تۆۋەندىكىسى جۈملە شەكىللەندۈرۈشنىڭ بەزى ئۇسۇللىرى؛

source: The bumblebee sped by.
ug: بۈركۈت تېز سۈرئەتتە ئۆتۈپ كەتتى.

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download. We would like to thank the following people and organizations for their help with the project:
ug: ئاۋاز ئۈزۈندە قەبىرىستانلىقى Common Voice غا قوشۇلمىغان ئاۋازلاردىن تەركىپ تاپقان بولۇپ باشقا سانلىق مەلۇمات توپلىمىغا ئوخشاش چۈشۈرۈشكە بولىدۇ.

source: The clip has disrespectful or offensive language.
ug: بۇ ئاۋاز بۆلىكىدە ھۆرمەتسىزلىك ياكى ھاقارەت تىلى بار.

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
ug: Common Voice سانلىق مەلۇمات ئامبىرىدا نەچچە يۈزلىگەن، مىڭلىغان ئاۋاز ئەۋرىشكىسى بار بولۇپ ، پروگراممېرلارنىڭ ئاۋاز پەرقلەندۈرۈش قورالى قۇرۇشىغا ياردەم بېرىدۇ.

source: The community is the beating heart of Common Voice - they come from all over the world, and are language activists and scientists and artists. You can learn more about how to get involved on our <about>About</about> page and in our <community>Community playbook</community>. If you're interested in deeper organisational partnership, <emailFragment>get in touch.</emailFragment>
ug: جامائەت Common Voice نىڭ ھەرىكەتلەندۈرگۈچ كۈچ مەنبەسى، ئۇلار دۇنيانىڭ ھەر قايسى جايلىرىدىن كەلگەن، بەلكىم تىل ئاكتىپى، ئالىم ۋە سەنئەتكار بولۇشى مۇمكىن.سىز بىنىڭ <about>ھەققىدە</about> بېتىمىز ۋە <community>جامائەت قوللانمىسى</community>دىن قاتنىشىش تەپسىلاتىنى بىلەلەيسىز.ئەگەر تېخىمۇ چوڭقۇر تەشكىلىي ھەمكارلىققا قىزىقسىڭىز، <emailFragment>بىز بىلەن ئالاقىلىشىڭ.</emailFragment>

source: The content contains a language different than I was expecting.
ug: مەزمۇندا مەن كۈتكەندىن پەرقلىق تىلدىكى مەزمۇن بار.

source: The content has disrespectful or offensive language.
ug: بۇ مەزمۇندا ھۆرمەتسىزلىك ياكى ھاقارەت تىلى بار.

source: The giant dino [cough] the Triassic.
ug: ترىئاسىك ئېراسىنىڭ گىگ[ئۆھۆ] دىنوزاۋرى.

source: The giant dinosaur of the Triassic.
ug: ترىئاسىك ئېراسىنىڭ گىگانت دىنوزاۋرى.

source: The giant dinosaurs of the Triassi-.
ug: ترىئاسى- ئېراسىنىڭ گىگانت دىنوزاۋرلىرى.

source: The giant dinosaurs of the Triassic.
ug: ترىئاسىك ئېراسىنىڭ گىگانت دىنوزاۋرلىرى.

source: The giant dinosaurs of the Triassic. [read by one voice]
ug: ترىئاسىك ئېراسىنىڭ گىگانت دىنوزاۋرلىرى. [باشقا بىرى ئوقۇۋاتىدۇ]

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
ug: ترىئاسىك ئېراسىنىڭ گىگانت دىنوزاۋرلىرى. <strong>[باشقا بىرى ئوقۇۋاتىدۇ]</strong>

source: The giant dinosaurs of the Triassic. Yes.
ug: ترىئاسىك ئېراسىنىڭ گىگانت دىنوزاۋرلىرى. ھەئە.

source: The giant dino <strong>[cough]</strong> the Triassic.
ug: ترىناسىك ئېراسىنىڭ گى <strong>[ئۆھۆ]</strong>دىنوزاۋرلىرى.

source: The MediaRecorder API is not supported in your browser.
ug: توركۆرگۈڭىز MediaRecorder API نى قوللىمايدۇ.

source: The number of recordings and which languages you contribute to will be public.
ug: ئۈنگە ئېلىنغان ئاۋاز سانىڭىز ۋە قايسى تىلغا تۆھپە قوشقانلىقىڭىز ئاشكارا ھالدا بولىدۇ.

source: The page you are looking for could not be found
ug: سىز ئىزدەۋاتقان بەت تېپىلمىدى

source: There are currently no prompts for this language. Please refresh the page or try again later.
ug: نۆۋەتتە بۇ تىلنىڭ ھېچقانداق ئەسكەرتىشى يوق. بەتنى يېڭىلاڭ ياكى سەل تۇرۇپ قايتا سىناڭ.

source: There are currently no sentences to review in this language.
ug: ھازىر بۇ تىلدا تەكشۈرىدىغان جۈملىلەر يوق.

source: There are currently no transcriptions to check for this language. Please refresh the page or try again later.
ug: ھازىر بۇ تىلدا ھېچقانداق خەت پۈتۈك يوق. بەتنى يېڭىلاڭ ياكى سەل تۇرۇپ قايتا سىناڭ.

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
ug: تىل ھەققىدە ناھايىتى كۆپ تەپەككۇر ئۇسۇللىرى بار. ئاۋاز تونۇش مودېلىنىڭ مەقسىتى ئۈچۈن، Common Voice «ئۆزئارا چۈشىنىشچانلىق» قا، ياكى «بۇ تىلدا سۆزلىگۈچىلەر چۈشىنەي دېسە ئاساسەن بىر-بىرىنى چۈشىنەلەمدۇ؟ » دېگەن مەسىلىگە مەركەزلەشتۈرۈشنى تەۋسىيە قىلىدۇ.

source: The recording was too long.
ug: خاتىرىلەش بەك ئۇزۇن بولۇپ قالدى.

source: The recording was too quiet.
ug: خاتىرىلەش بەك پەس بولۇپ قالدى.

source: The recording was too short.
ug: خاتىرىلەش بەك قىسقا بولۇپ قالدى.

source: There is currently no audio to transcribe for this language. Please refresh the page or try again later.
ug: ھازىر بۇ تىلدا خەتكە پۈتىدىغان ئاۋاز يوق. بەتنى يېڭىلاڭ ياكى سەل تۇرۇپ قايتا سىناڭ.

source: There should ideally be no digits in the source text because they can cause problems when read aloud. The way a number is read depends on context and might introduce confusion in the dataset. For example, the number “2409” could be accurately read as both “twenty-four zero nine” and “two thousand four hundred nine”.
ug: ئەسلى تېكىستتە ئەڭ ياخشىسى سان بولماسلىقى كېرەك ، چۈنكى ئۇلار يۇقىرى ئاۋازدا ئوقۇغاندا مەسىلە كەلتۈرۈپ چىقىرىدۇ. ساننىڭ ئوقۇلۇشى مەزمۇنغا باغلىق بولۇپ، ساندان توپلىمىدا قالايمىقانچىلىق پەيدا قىلىشى مۇمكىن. مەسىلەن، «13123456789» دېگەن ساننى ئەمەلىيەتتە «بىر يۈز ئوتتۇز بىر، يىگىرمە ئۈچ قىرىق بەش، ئاتمىش يەتتە سەكسەن توققۇز» ۋە «ئون ئۈچ مىليارد، بىر يۈز يىگىرمە ئۈچ مىليون، تۆت يۈز ئەللىك ئالتە مىڭ، يەتتە يۈز سەكسەن توققۇز» دەپ ئوقۇشقا بولىدۇ.

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
ug: ئوقۇرمەنلەرنىڭ ئاۋازىنىڭ يۇقىرى تۆۋەنلىكىدە تەبىئىي پەرق بولىدۇ. پەقەت ئاۋازى بەك يۇقىرى بولۇپ ئۈنگە ئېلىش ئۈزۈلۈپ كەتكەن ياكى (كۆپ ئۇچرايدىغان ئەھۋالدا) ئاۋاز بەك تۆۋەن بولغانلىقتىن تېكىست بولمىسا نېمە دەۋاتقانلىقىنى بىلگىلى بولمىغان بولسا رەت قىلىنىدۇ.

source: The route was unclear.
ug: يول ئېنىق ئەمەس.

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
ug: نۆۋەتتە بۇ تىللار جامائەت ئىجادىيەت باسقۇچىدا تۇرۇۋاتىدۇ. بۇلار ھەر قايسى تىللارنىڭ <localizationGlossaryLink>تور بېكەتنى يەرلىكلەشتۈرۈش</localizationGlossaryLink> شۇنداقلا <sentenceCollectionGlossaryLink>جۈملە يىغىش</sentenceCollectionGlossaryLink> ئەھۋالىنى كۆرسىتىدۇ.

source: The selected file is too large
ug: تاللانغان ھۆججەت بەك چوڭ

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
ug: جۈملە يىغقۇچ Common Voice سۇپىسىغا يۆتكىلىۋاتىدۇ. سىز ھازىر بىر جۈملە <writeURL>يېزىپ</writeURL> ياكى بىر جۈملە <reviewURL>تەكشۈرۈپ</reviewURL> ئۇنى Common Voice قا يوللىيالايسىز.

source: The sentence has a grammatical or spelling error.
ug: بۇ جۈملىدە گرامماتىكىلىق ياكى ئىملا خاتالىقى بار.

source: The sentence has disrespectful or offensive language.
ug: بۇ جۈملىدە ھۆرمەتسىزلىك ياكى ھاقارەت تىلى بار.

source: The sentence must be grammatically correct.
ug: جۈملىنىڭ گرامماتىكىسى چوقۇم توغرا بولۇشى كېرەك.

source: The sentence must be speakable.
ug: جۈملىنى سۆزلىگىلى بولىدىغان بولۇشى كېرەك.

source: The sentence must be spelled correctly.
ug: جۈملىنىڭ ئىملاسى چوقۇم توغرا يېزىلىشى كېرەك.

source: The sentence should have fewer than 15 words.
ug: جۈملىدە 15 تىن ئاز سۆز بولۇشى كېرەك.

source: The site is ready to be launched when it reaches 75% completion.
ug: توربەتنىڭ %75 تەرجىمە خىزمىتى پۈتكەندىن كېيىن ئېلان قىلىشقا بولىدۇ.

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
ug: بۇ تور بېكەت ئامالنىڭ بارىچە تېزلىكتە زاپاسلىنىدۇ. ئەڭ يېڭى ئۇچۇرغا ئېرىشمەكچى بولسىڭىز، <matrixLink>Matrix</matrixLink> گە قاتنىشىڭ ياكى <githubLink>GitHub</githubLink> نى زىيارەت قىلىڭ ۋە ياكى <discourseLink> مۇنازىرە مۇنبىرىمىز </discourseLink> گە ئۇچرىغان مەسىلىلەرنى يوللاڭ.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
ug: TED-LIUM سۆزلۈكلەر توپلىمى ئاۋازلىق سۆھبەتلەردىن ياسالغان بولۇپ ، ئۇلارنىڭ خاتىرىلىرى TED تور بېتىدە بار.

source: The website text is translated into that language.
ug: تور بېكەت تېكىستى شۇ تىلغا تەرجىمە قىلىنىدۇ.

source: This content contains personally identifiable information related to an individual's identity, such as their name, email address, location, identification number, or phone number.
ug: بۇ مەزمۇندا شەخسىي سالاھىيەت ئۇچۇرى بار، مەسىلەن، ئۇلارنىڭ ئىسمى، ئېلخەت ئادرېسى، ئورنى، كىملىك نومۇرى ياكى تېلېفون نومۇرى.

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
ug: بۇ ئۇچۇرلارنى تەمىنلەش ئىختىيارىي - ئۆزىڭىز راھەت ھېس قىلغاندىلا ئاندىن تەمىنلىسىڭىز بولىدۇ. بىز سانلىق مەلۇمات توپلىمىنى تارقاتقاندا، بارلىق شەخسىي ئۇچۇرلارنى نامسىزلاشتۇرىمىز، ئىسم ۋە ئېلخەت قاتارلىق ئۇچۇرلىرىڭىزنىڭ ياش ياكى جىنسقا ئوخشاش نوپۇس ئۇچۇرلىرىغا ئۇلانمايدىغانلىقىغا كاپالەتلىك قىلىمىز.

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
ug: بۇ ئىشلىتىش مىسالى رەقەملىك ئاۋازدىكى ھەئە / ياق نى تونۇش ئىمكانىيىتىگە ئىگە قىلىدىغان سانلىق مەلۇماتنى ئۆز ئىچىگە ئالىدۇ.

source: This is how you cite yourself if you wrote the content yourself.
ug: ئەگەر مەزمۇننى ئۆزىڭىز يازغان بولسىڭىز، ئۆزىڭىزنى قانداق نەقىل ئېلىشنى كۆرسىتىدۇ.

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
ug: بۇ تەڭشەك يېتەكچى تاختىڭىزنىڭ كۆرۈنۈشچانلىقىنى كونترول قىلىدۇ. يوشۇرۇنغاندا ، ئىلگىرىلىشىڭىز شەخسىي بولىدۇ. بۇ سىزنىڭ رەسىمىڭىز ، ئىشلەتكۈچى ئىسمىڭىز ۋە ئىلگىرىلىشىڭىز يېتەكچى تاختىسىدا كۆرۈنمەيدىغانلىقتىن دېرەك بېرىدۇ. شۇنىڭغا دىققەت قىلىڭكى ، يېتەكچى تاختىسىدىكى ئۆزگىرىشلەرنىڭ ئەكس ئېتىشى ئۈچۈن ~{ $minutes } مىنۇت كېتىدۇ.

source: Three to go!
ug: ئۈچى قالدى!

source: Tibetan
ug: تىبەتچە

source: Tigre
ug: تىگرېچە

source: Tigrinya
ug: تىگرىنياچە

source: To change or edit your email, send us an email to <emailFragment>commonvoice@mozilla.com</emailFragment>
ug: ئېلخەت ئادرېسىڭىزنى ئۆزگەرتىپ ياكى تەھرىرلىمەكچى بولسىڭىز، بىزگە <emailFragment>commonvoice@mozilla.com</emailFragment> ئېلخەت يوللاڭ.

source: Today
ug: بۈگۈن

source: Today's Common Voice progress on clips recorded
ug: Common Voice نىڭ خاتىرىلەنگەن ئاۋازدىكى بۈگۈنكى ئىلگىرىلىشى

source: Today's Common Voice progress on clips validated
ug: Common Voice نىڭ دەلىللەنگەن ئاۋازدىكى بۈگۈنكى ئىلگىرىلىشى

source: Today's Progress
ug: بۈگۈنكى ئىلگىرىلەش

source: Toki Pona
ug: توكى پوناچە

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
ug: Common Voice نىڭ سانلىق مەلۇمات ئامبىرىغا قوشۇش ئۈچۈن، بىر ئاۋاز چوقۇم ئىككى ئىشلەتكۈچى تەرىپىدىن دەلىللىنىشى كېرەك.

source: Too many files
ug: ھۆججەت بەك كۆپ

source: Top Contributors
ug: ئەجرى كۆپ تۆھپىكارلار

source: Total
ug: ئومۇمىي

source: Total Approved
ug: ئومۇمىي تەستىقلاندى

source: { $totalHours } hours is achievable in just over { $periodMonths } months if { $people } people record { $clipsPerDay } clips a day.
ug: سائەتيەتكىلى بولىدۇئايئەگەرئادەمئۈنگە ئالسائاۋازبىر كۈن

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
ug: ئوڭ تەرەپتە بىز پايدىلىق تەرىپىنى شۇنداقلا قايسى ئۇچۇرلارنى ئاشكارىلايدىغانلىقىمىزنى كۆرسىتىپ ئۆتتۇق. تۆۋەندىكى ئۇلىنىشنى ئىشلىتىش ئارقىلىق ئۈسكۈنىڭىزدە Common Voice ھېساباتىڭىزنى باشلاپ كىتىڭ.

source: Toward next goal
ug: كېيىنكى نىشانغا

source: Track progress here and on your stats page.
ug: ستاتىستىكا بېتىڭىز ياكى بۇ يەردىن ئىلگىرىلەشلەرنى ئىز قوغلاڭ.

source: Transcribe
ug: خەت پۈت

source: Transcribe Audio
ug: ئۈننى خەتكە پۈت

source: Transcribe audio recordings into text
ug: ئۈن خاتىرىسىنى تېكىسكە خاتىرىلەيدۇ

source: Transcribe audio recordings in your language
ug: تىلىڭىزدىكى ئاۋاز خاتىرىسىنى تېكىستكە خاتىرىلەيدۇ

source: Transcribe Audio <small>(Coming soon)</small>
ug: ئۈننى تېكىستكە خاتىرىلە<small>(پات يېقىندا قوشۇلىدۇ)</small>

source: Transcript edited successfully
ug: خەت پۈتۈك مۇۋەپپەقىيەتلىك تەھرىرلەندى

source: Transcript skipped successfully
ug: خەت پۈتۈكتىن مۇۋەپپەقىيەتلىك ئاتلىدى

source: Transcript submitted successfully
ug: خەت پۈتۈك مۇۋەپپەقىيەتلىك تاپشۇرۇلدى

source: Transcript voted successfully
ug: خەت پۈتۈككە مۇۋەپپەقىيەتلىك ھالدا بىلەت تاشلاندى

source: Transgender
ug: قوش جىنس

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
ug: <translateVideoLink> Pontoon نى قانداق ئىشلىتىش توغرىسىدىكى يېتەكچىنى كۆرۈڭ. </translateVideoLink>

source: Translating the site
ug: بېكەتنى تەرجىمە قىلىش

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
ug: ئىنگلىزچىدىن تەرجىمە قىلىنغان، ئەمما سىز باشقا تىللاردىكى <strong>تەۋسىيەلەر</strong>نى كۆرەلەيسىز. <strong>تەرجىمىھال</strong> سىنبەلگىسى، ئاندىن <strong>تەڭشەكلەر</strong> ئۇلانمىسىنى چېكىپ سىز سۆزلىيەلەيدىغان خالىغان تىلنى قوشالايسىز.ئوڭ ئاستى بۇرجەكتە <strong>يەرلىك</strong> دەپ ئاتالغان تەرجىمىلەر تىزىمى بار. تەرجىمىلەر بىر كۈندىن كېيىن بېكەتتە كۆرۈنىدۇ.

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
ug: Common Voice نىڭ تەرجىمە خىزمىتى <strong>Pontoon</strong> دا ئېلىپ بېرىلىدۇ.

source: Try again by dragging your file here
ug: ھۆججىتىڭىزنى بۇ يەرگە سۆرەپ قايتا سىناڭ

source: Try uploading again
ug: قايتا يۈكلەپ سىناڭ

source: Tshivenda
ug: ۋېنداچە

source: Tunen
ug: تۇنېن

source: Tupuri
ug: تۇپۇرى

source: Turkish
ug: تۈركچە

source: Turkmen
ug: تۈركمەنچە

source: Tuvan
ug: تۇۋاچە

source: Twi
ug: تىۋىچە

source: Typically megabytes
ug: ئادەتتە مېگابايت

source: Udmurt
ug: ئۇدمۇرتچە

source: Ukrainian
ug: ئۇكرائىنچە

source: Understand contribution criteria
ug: تۆھپە ئۆلچىمىنى چۈشىنىڭ

source: Understand how to contribute and validate sentences and audio clips to the Common Voice dataset
ug: Common Voice سانلىق مەلۇمات ئامبىرىغا جۈملە ۋە ئاۋاز ئۈزۈندىلىرىنى قانداق قوشۇپ ۋە دەلىللەپ تۆھپە قوشۇشنى چۈشىنىش

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
ug: ئاۋاز ئۈزۈندەسىنى ئاڭلىغاندا نېمىلەرگە دىققەت قىلىدىغانلىقىنى چۈشىنىڭ، شۇنداق قىلسىڭىز ئۈن خاتىرىڭىزنى بېيىتىشىڭىزغا ياردىمى تېگىدۇ.

source: Universities, Academics and Researchers
ug: ئالىي مەكتەپ، ئالىم ۋە تەتقىقاتچىلار

source: Upload aborted. Do you want to delete your recordings?
ug: يۈكلەش ئەمەلدىن قالدۇرۇلدى. ئۈن خاتىرىسىنى ئۆچۈرەمسىز؟

source: Upload an image file
ug: رەسىم ھۆججىتىنى يۈكلە

source: { $uploadedSentences } of { $totalSentences } sentences collected
ug: { $uploadedSentences } / { $totalSentences } جۈملە توپلاندى

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
ug: { $uploadedSentences } / { $totalSentences } جۈملە توپلاندى. <downloadLink>بۇ جاي</downloadLink> چېكىلسە رەت قىلىنغان جۈملىنى چۈشۈرىدۇ.

source: Upload failed, please retry.
ug: يۈكلىيەلمىدى، قايتا سىناڭ.

source: Upload <icon></icon> public domain sentences
ug: ئاممىۋى دائىرىدىكى جۈملە <icon> </icon> يۈكلەڭ

source: Upload in progress...
ug: يۈكلىنىۋاتىدۇ…

source: Upload more sentences?
ug: تېخىمۇ كۆپ چۈملە يۈكلەمسىز؟

source: Upload of this clip keeps failing at server. Reload the page or try again later.
ug: بۇ ئاۋاز خاتىرىسىنى مۇلازىمېتىرغا يۈكلىگىلى بولمايۋاتىدۇ. بەتنى يېڭىلاڭ ياكى كېيىن قايتا سىناپ بېقىڭ.

source: Upload of this clip keeps failing, keep retrying?
ug: بۇ قىسقۇچنى يۈكلەش مەغلۇپ بولدى ، قايتا سىنامسىز؟

source: Urdu
ug: ئوردۇچە

source: Use correct grammar
ug: گىرامماتېكىنى توغرا ئىشلەتكەن
